lpodkalicki/blog/stm32/STM32Cube_FW_F0_V1.9.0/Drivers/BSP/STM32F072B-Discovery/stm32f072b_discovery.c
  HAL_GPIO_Init(LED_PORT[Led], &GPIO_InitStruct);
  
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET); 
}

/**
  * @brief  Turns selected LED On.
  * @param  Led Specifies the Led to be set on. 
  *   This parameter can be one of following parameters:
  *     @arg LED3
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  * @retval None
  */
void BSP_LED_On(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET); 
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led Specifies the Led to be set off. 
  *   This parameter can be one of following parameters:
  *     @arg LED3
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  * @retval None
  */
void BSP_LED_Off(Led_TypeDef Led)
{
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET); 
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led Specifies the Led to be toggled. 
  *   This parameter can be one of following parameters:
  *     @arg LED3
  *     @arg LED4
  *     @arg LED5
  *     @arg LED6
  * @retval None
  */
void BSP_LED_Toggle(Led_TypeDef Led)
{
  HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
}

/**
  * @brief  Configures Button GPIO and EXTI Line.
  * @param  Button Specifies the Button to be configured.
  *   This parameter should be: BUTTON_USER
  * @param  Mode Specifies Button mode.
  *   This parameter can be one of following parameters:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO 
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with interrupt
  *                            generation capability  
  * @retval None
  */
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef Mode)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* Enable the BUTTON Clock */
  BUTTONx_GPIO_CLK_ENABLE(Button);
  __HAL_RCC_SYSCFG_CLK_ENABLE();

  GPIO_InitStruct.Pin = BUTTON_PIN[Button];
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

  if(Mode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStruct);
  }

  if(Mode == BUTTON_MODE_EXTI)
  {
    /* Configure Button pin as input with External interrupt */
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING; 
    HAL_GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStruct);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((IRQn_Type)(BUTTON_IRQn[Button]), 0x03, 0x00);
    HAL_NVIC_EnableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
  }
}

/**
  * @brief  Returns the selected Push Button state.
  * @param  Button Specifies the Button to be checked.
  *   This parameter should be: BUTTON_USER  
  * @retval The Button GPIO pin value.
  */
uint32_t BSP_PB_GetState(Button_TypeDef Button)
{
  return HAL_GPIO_ReadPin(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}

/**
  * @}
  */ 

/** @addtogroup STM32F072B_DISCOVERY_BUS_Operations_Functions
  * @{
  */ 
  
/******************************************************************************
                            BUS OPERATIONS
*******************************************************************************/
#if defined(HAL_I2C_MODULE_ENABLED)
/******************************* I2C Routines**********************************/

/**
  * @brief Discovery I2Cx MSP Initialization
  * @param hi2c I2C handle
  * @retval None
  */
static void I2Cx_MspInit(I2C_HandleTypeDef *hi2c)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;

  /* Enable GPIO clock */
  DISCOVERY_I2Cx_GPIO_CLK_ENABLE();
      
  /* Configure I2C Tx and Rx as alternate function  */
  GPIO_InitStruct.Pin = (DISCOVERY_I2Cx_SCL_PIN | DISCOVERY_I2Cx_SDA_PIN);
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = DISCOVERY_I2Cx_AF;
  HAL_GPIO_Init(DISCOVERY_I2Cx_GPIO_PORT, &GPIO_InitStruct);

  /* Enable the DMA clock */
  DISCOVERY_EEPROM_DMA_CLK_ENABLE();
    
  /* Configure the DMA channel for the EEPROM peripheral TX direction */
  /* Configure the DMA channel */
  hdma_tx.Instance                  = DISCOVERY_EEPROM_DMA_CHANNEL_TX;
  /* Set the parameters to be configured */
  hdma_tx.Init.Direction            = DMA_MEMORY_TO_PERIPH;
  hdma_tx.Init.PeriphInc            = DMA_PINC_DISABLE;
  hdma_tx.Init.MemInc               = DMA_MINC_ENABLE;
  hdma_tx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
  hdma_tx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
  hdma_tx.Init.Mode                 = DMA_NORMAL;
  hdma_tx.Init.Priority             = DMA_PRIORITY_VERY_HIGH;

  /* Associate the initilalized hdma_rx handle to the the husart handle*/
  __HAL_LINKDMA(hi2c, hdmatx, hdma_tx);
    
  /* Configure the DMA Stream */
  HAL_DMA_Init(&hdma_tx);
    
  /* Configure and enable DMA TX Channel interrupt */
  HAL_NVIC_SetPriority((IRQn_Type)(DISCOVERY_EEPROM_DMA_TX_IRQn), DISCOVERY_EEPROM_DMA_PREPRIO, DISCOVERY_EEPROM_DMA_SUBPRIO);
  HAL_NVIC_EnableIRQ((IRQn_Type)(DISCOVERY_EEPROM_DMA_TX_IRQn));
    
  /* Configure the DMA channel for the EEPROM peripheral RX direction */
  /* Configure the DMA channel */
  hdma_rx.Instance                  = DISCOVERY_EEPROM_DMA_CHANNEL_RX;
  /* Set the parameters to be configured */
  hdma_rx.Init.Direction            = DMA_PERIPH_TO_MEMORY;
  hdma_rx.Init.PeriphInc            = DMA_PINC_DISABLE;
  hdma_rx.Init.MemInc               = DMA_MINC_ENABLE;
  hdma_rx.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
  hdma_rx.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
  hdma_rx.Init.Mode                 = DMA_NORMAL;
  hdma_rx.Init.Priority             = DMA_PRIORITY_VERY_HIGH;

  /* Associate the initilalized hdma_rx handle to the the husart handle*/
  __HAL_LINKDMA(hi2c, hdmarx, hdma_rx);
    
